package JavaProgramming.Homework.Lesson9.Task5;

/*
* Даны два целых числа A и В. Выведите все числа от A до B включительно,
* в порядке возрастания, если A < B, или в порядке убывания в противном случае.
* Использовать рекурсию.
* */
public class Test5 {

    public void printNumber(int a, int b){
        if(a == b) {
            System.out.println(a);
        } else if(a < b){
            // !!!!!!!! ПОКА НЕ ПОЙМУ КАК СДЕЛАТЬ ЭТУ ЗАДАЧУ !!!!!!
        }
    }
}
