package JavaProgramming.Homework.Lesson4.Task4;


/**
 * Среднее значение чисел
 *
 * Вычислить среднее значение трех вещественных чисел передаваемых на вход программы
 * в качестве аргументов.
 * Для преобразования из String в double используйте метод Double.parseDouble(String s).
 */
public class MN {

    public static void main(String[] args) {
        for (String s :
                args) {
            System.out.println(s);
        }
    }
}
