package JavaProgramming.Homework.Lesson3.Task1;

/**
 * Создать программу, в которой используются однострочные и многострочные комментарии.
 */
public class Test {
// Однострочный комментарий
/*
* Многострочный комментарий
*/

    public static void main(String[] args) {
        System.out.println("");
    }
}
