package JavaProgramming.Homework.Lesson3.Task1;

/**
 * Создать программу, в которой используются однострочные и многострочные комментарии.
 */
public class Test {
// Однострочный комментарий
/*
* Многострочный комментарий
*/

    public static void main(String[] args) {
        int[] mass = new int[]{1,2,3,4,5};

        for (int b :
                mass) {
            System.out.println(b);
        }
    }
}
